# Pandas

Pandas is a powerful data manipulation library in Python. widely used for data analysis and data cleaning. It provides two primary data structure. Series and DataFrame while

### (1) Series 
A series is one-dimesional array-like object that can hold any data type. It is similar to column in table.

(a) Creating Series

In [ ]:
import pandas as pd
data=[1,2,3,4,5]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

(b) Creating Series from Dictionary

In [6]:
data = {'a':1,'b':2,'c':3}
series=pd.Series(data)
print(series)#keys will be considered as index and values will be considered as series values

a    1
b    2
c    3
dtype: int64

In [7]:
data=[10,20,30,40]
index=['a','b','c','d']
pd.Series(data,index)

a    10
b    20
c    30
d    40
dtype: int64

### (2) DataFrame 
DataFrame is a two-dimensional, size -mutable, and potentially heterogeneous tabular data structure with labeled axes(rows and coloums).

(a) Creating DataFrame from a Dictionary of Lists

In [8]:
data ={
'Name':['Manish','Joan','Jason','Vladimir'],
'Age':['18','24','26','55'],
'City':['Indore','Barcelona','Londan','Moscow']
}
index =['a','b','c','d']    
df=pd.DataFrame(data,index)
print(df)
print(type(df))

       Name Age       City
a    Manish  18     Indore
b      Joan  24  Barcelona
c     Jason  26     Londan
d  Vladimir  55     Moscow
<class 'pandas.core.frame.DataFrame'>

(b) Creating DataFrame from List of Dictionaries

In [9]:
data1 =[
{'Name':'Manish','Age':18,'City':'Indore'},
{'Name':'Joan','Age':24,'City':'Barcelona'},
{'Name':'Jason','Age':26,'City':'London'},
{'Name':'Vladimir','Age':55,'City':'Moscow'},
]

df1=pd.DataFrame(data1)
print(df1)
print(type(df1))

       Name  Age       City
0    Manish   18     Indore
1      Joan   24  Barcelona
2     Jason   26     London
3  Vladimir   55     Moscow
<class 'pandas.core.frame.DataFrame'>

(c) In a DataFrame setting index as First column

In [ ]:
data = {'Name':['Manish','Joan','Jason','Vladimir','Alex','Donald'],
'Age':['18','24','26','55','24','70'],
'City':['Indore','Barcelona','Londan','Moscow','Texas','New York']
}
#We have to set index as first column 'Name'
df2=pd.DataFrame(data)
df2.set_index('Name',inplace=True)
print(df2)



df = pd.read_csv('Manish.csv')
df.head()

         Age       City
Name
Manish    18     Indore
Joan      24  Barcelona
Jason     26     Londan
Vladimir  55     Moscow
Alex      24      Texas
Donald    70   New York

(d) Working with csv file

In [11]:
sales_df=pd.read_csv('sales_csv.csv')
sales_df

   OrderID        Date     Product  Quantity  Price   Total
0     1001  2024-12-01      Laptop         2  55000  110000
1     1002  2024-12-02  Smartphone         5  18000   90000
2     1003  2024-12-03  Headphones        10   1500   15000
3     1004  2024-12-04      Tablet         3  25000   75000
4     1005  2024-12-05  Smartwatch         4   8000   32000
5     1006  2024-12-06     Monitor         2  12000   24000
6     1007  2024-12-07    Keyboard         6   1200    7200
7     1008  2024-12-08       Mouse         8    800    6400
8     1009  2024-12-09     Printer         1  15000   15000
9     1010  2024-12-10      Camera         2  30000   60000

In [12]:
sales_df=pd.read_csv('sales_csv.csv')
sales_df.head(5)#head(5)We will get first or top 5 entries

   OrderID        Date     Product  Quantity  Price   Total
0     1001  2024-12-01      Laptop         2  55000  110000
1     1002  2024-12-02  Smartphone         5  18000   90000
2     1003  2024-12-03  Headphones        10   1500   15000
3     1004  2024-12-04      Tablet         3  25000   75000
4     1005  2024-12-05  Smartwatch         4   8000   32000

In [13]:
sales_df.tail(5)#tail(5) will give us last 5 entries

   OrderID        Date   Product  Quantity  Price  Total
5     1006  2024-12-06   Monitor         2  12000  24000
6     1007  2024-12-07  Keyboard         6   1200   7200
7     1008  2024-12-08     Mouse         8    800   6400
8     1009  2024-12-09   Printer         1  15000  15000
9     1010  2024-12-10    Camera         2  30000  60000

In [14]:
### Accessing Data from DataFrame
sales_df
sales_df['Product']#Will print all Product or We have accessed Series Product from DataFrames sales_df.

0        Laptop
1    Smartphone
2    Headphones
3        Tablet
4    Smartwatch
5       Monitor
6      Keyboard
7         Mouse
8       Printer
9        Camera
Name: Product, dtype: object

In [15]:
sales_df.loc[0]#We can access Row using loc method

OrderID           1001
Date        2024-12-01
Product         Laptop
Quantity             2
Price            55000
Total           110000
Name: 0, dtype: object

In [16]:
print(sales_df.loc[0, 'Product'])   
print(sales_df.loc[0, 'Quantity'])

Laptop
2

In [17]:
#We can also use iloc to access rows and columns by their integer position
#Used to access elements by position using row and coloumn numbers
sales_df.iloc[0]

OrderID           1001
Date        2024-12-01
Product         Laptop
Quantity             2
Price            55000
Total           110000
Name: 0, dtype: object

In [18]:
print(sales_df.iloc[0, 2])   
print(sales_df.iloc[5, 1])

Laptop
2024-12-06

In [19]:
#Accessing a specified element
sales_df.at[1,'Date']#From Row which is 1 take Date or[Row index,column name]

'2024-12-02'

In [20]:
#Accessing specified element using iat
sales_df.iat[2,2]#[Row index,column,index]

'Headphones'

(d) Data Manipulation with DataFrame

(i) Adding a column

In [21]:
sales_df

   OrderID        Date     Product  Quantity  Price   Total
0     1001  2024-12-01      Laptop         2  55000  110000
1     1002  2024-12-02  Smartphone         5  18000   90000
2     1003  2024-12-03  Headphones        10   1500   15000
3     1004  2024-12-04      Tablet         3  25000   75000
4     1005  2024-12-05  Smartwatch         4   8000   32000
5     1006  2024-12-06     Monitor         2  12000   24000
6     1007  2024-12-07    Keyboard         6   1200    7200
7     1008  2024-12-08       Mouse         8    800    6400
8     1009  2024-12-09     Printer         1  15000   15000
9     1010  2024-12-10      Camera         2  30000   60000

In [22]:
sales_df['Discount(in %)']=[5,5,10,5,10,5,10,10,10,5]
sales_df

   OrderID        Date     Product  Quantity  Price   Total  Discount(in %)
0     1001  2024-12-01      Laptop         2  55000  110000               5
1     1002  2024-12-02  Smartphone         5  18000   90000               5
2     1003  2024-12-03  Headphones        10   1500   15000              10
3     1004  2024-12-04      Tablet         3  25000   75000               5
4     1005  2024-12-05  Smartwatch         4   8000   32000              10
5     1006  2024-12-06     Monitor         2  12000   24000               5
6     1007  2024-12-07    Keyboard         6   1200    7200              10
7     1008  2024-12-08       Mouse         8    800    6400              10
8     1009  2024-12-09     Printer         1  15000   15000              10
9     1010  2024-12-10      Camera         2  30000   60000               5

(ii) Removing a column

In [23]:
# sales_df.drop('Discount(in %)')
# # KeyError occurs because drop() removes rows by default (axis=0).
# # Pandas looks for 'Discount(in %)' in the ROW NAMES on the left side.
# # But 'Discount(in %)' is written at the TOP of the table (it is a column).
# # Since no row has this name, pandas raises a KeyError.

In [24]:
sales_df.drop('Discount(in %)',axis=1)
# Now, we specified axis=1, so pandas looks for 'Discount(in %)' in the COLUMN NAMES at the TOP of the table.
# It finds it and removes the entire column.

   OrderID        Date     Product  Quantity  Price   Total
0     1001  2024-12-01      Laptop         2  55000  110000
1     1002  2024-12-02  Smartphone         5  18000   90000
2     1003  2024-12-03  Headphones        10   1500   15000
3     1004  2024-12-04      Tablet         3  25000   75000
4     1005  2024-12-05  Smartwatch         4   8000   32000
5     1006  2024-12-06     Monitor         2  12000   24000
6     1007  2024-12-07    Keyboard         6   1200    7200
7     1008  2024-12-08       Mouse         8    800    6400
8     1009  2024-12-09     Printer         1  15000   15000
9     1010  2024-12-10      Camera         2  30000   60000

In [25]:
sales_df
#Now we can see that the original DataFrame is unchanged.
#This is because, by default, drop() returns a new DataFrame with the specified labels removed.

   OrderID        Date     Product  Quantity  Price   Total  Discount(in %)
0     1001  2024-12-01      Laptop         2  55000  110000               5
1     1002  2024-12-02  Smartphone         5  18000   90000               5
2     1003  2024-12-03  Headphones        10   1500   15000              10
3     1004  2024-12-04      Tablet         3  25000   75000               5
4     1005  2024-12-05  Smartwatch         4   8000   32000              10
5     1006  2024-12-06     Monitor         2  12000   24000               5
6     1007  2024-12-07    Keyboard         6   1200    7200              10
7     1008  2024-12-08       Mouse         8    800    6400              10
8     1009  2024-12-09     Printer         1  15000   15000              10
9     1010  2024-12-10      Camera         2  30000   60000               5

In [26]:
sales_df.drop('Discount(in %)', axis=1, inplace=True)
#Now, the original DataFrame is changed because we used inplace=True.

In [27]:
sales_df
#Now the 'Discount(in %)' column has been removed from sales_df permanently.

   OrderID        Date     Product  Quantity  Price   Total
0     1001  2024-12-01      Laptop         2  55000  110000
1     1002  2024-12-02  Smartphone         5  18000   90000
2     1003  2024-12-03  Headphones        10   1500   15000
3     1004  2024-12-04      Tablet         3  25000   75000
4     1005  2024-12-05  Smartwatch         4   8000   32000
5     1006  2024-12-06     Monitor         2  12000   24000
6     1007  2024-12-07    Keyboard         6   1200    7200
7     1008  2024-12-08       Mouse         8    800    6400
8     1009  2024-12-09     Printer         1  15000   15000
9     1010  2024-12-10      Camera         2  30000   60000

(iii) Increasing the values by specific numbers in a column

In [28]:
#Now we will increase the Price of all products by 10%
sales_df['Price']=sales_df['Price']*1.1
sales_df

   OrderID        Date     Product  Quantity    Price   Total
0     1001  2024-12-01      Laptop         2  60500.0  110000
1     1002  2024-12-02  Smartphone         5  19800.0   90000
2     1003  2024-12-03  Headphones        10   1650.0   15000
3     1004  2024-12-04      Tablet         3  27500.0   75000
4     1005  2024-12-05  Smartwatch         4   8800.0   32000
5     1006  2024-12-06     Monitor         2  13200.0   24000
6     1007  2024-12-07    Keyboard         6   1320.0    7200
7     1008  2024-12-08       Mouse         8    880.0    6400
8     1009  2024-12-09     Printer         1  16500.0   15000
9     1010  2024-12-10      Camera         2  33000.0   60000

(iv) Removing a row

In [29]:
sales_df.drop(0,inplace=True)

In [30]:
sales_df

   OrderID        Date     Product  Quantity    Price  Total
1     1002  2024-12-02  Smartphone         5  19800.0  90000
2     1003  2024-12-03  Headphones        10   1650.0  15000
3     1004  2024-12-04      Tablet         3  27500.0  75000
4     1005  2024-12-05  Smartwatch         4   8800.0  32000
5     1006  2024-12-06     Monitor         2  13200.0  24000
6     1007  2024-12-07    Keyboard         6   1320.0   7200
7     1008  2024-12-08       Mouse         8    880.0   6400
8     1009  2024-12-09     Printer         1  16500.0  15000
9     1010  2024-12-10      Camera         2  33000.0  60000

(v) Other methods ands opeartions we can use in csv file

In [31]:
#Statistical summary
sales_df.describe()

           OrderID   Quantity         Price         Total
count     9.000000   9.000000      9.000000      9.000000
mean   1006.000000   4.555556  13627.777778  36066.666667
std       2.738613   3.004626  11699.424962  31145.946767
min    1002.000000   1.000000    880.000000   6400.000000
25%    1004.000000   2.000000   1650.000000  15000.000000
50%    1006.000000   4.000000  13200.000000  24000.000000
75%    1008.000000   6.000000  19800.000000  60000.000000
max    1010.000000  10.000000  33000.000000  90000.000000

In [32]:
#Return data types of each column
print(sales_df.dtypes)

OrderID       int64
Date         object
Product      object
Quantity      int64
Price       float64
Total         int64
dtype: object

(vi) Handling Missing Values

In [33]:
student_df=pd.read_csv('student_data.csv')
student_df

,StudentID,Name,Age,Gender,MathScore,ScienceScore,Attendance,City
0,101,Amit,20.0,M,78.0,85.0,92.0,Delhi
1,102,Riya,21.0,F,82.0,NaN,88.0,Mumbai
2,103,Rahul,21.0,M,65.0,70.0,75.0,Bangalore
3,104,Priya,20.0,F,90.0,92.0,NaN,Chennai
4,105,Ankit,22.0,M,NaN,60.0,80.0,NaN
5,106,Neha,21.0,F,88.0,91.0,95.0,Pune
6,107,Sachin,23.0,M,72.0,NaN,85.0,Delhi
7,108,Kavya,20.0,F,85.0,89.0,NaN,Mumbai
8,109,Rohit,19.0,M,68.0,72.0,78.0,Jaipur
9,110,Simran,22.0,F,91.0,94.0,96.0,NaN
10,111,Arjun,21.0,M,NaN,65.0,NaN,Indore
11,112,Meena,20.0,F,80.0,83.0,90.0,Bhopal

In [34]:
#Check for missing values
student_df.isnull()
# this will return a DataFrame of the same shape as student_df, with True indicating missing values and False indicating non-missing values.

,StudentID,Name,Age,Gender,MathScore,ScienceScore,Attendance,City
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,True,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,True,False
4,False,False,False,False,True,False,False,True
5,False,False,False,False,False,False,False,False
6,False,False,False,False,False,True,False,False
7,False,False,False,False,False,False,True,False
8,False,False,False,False,False,False,False,False
9,False,False,False,False,False,False,False,True
10,False,False,False,False,True,False,True,False
11,False,False,False,False,False,False,False,False

In [35]:
student_df.isnull().any()
# this will return a Series with column names as index and boolean values indicating whether each column contains any missing values.
# for example, if the 'Age' column has any missing values, the corresponding value in the Series will be True; otherwise, it will be False.

StudentID       False
Name            False
Age             False
Gender          False
MathScore        True
ScienceScore     True
Attendance       True
City             True
dtype: bool

In [ ]:
student_df.isnull().sum()
# This will give the count of missing values in each column of the student_df DataFrame.

StudentID       0
Name            0
Age             0
Gender          0
MathScore       2
ScienceScore    2
Attendance      3
City            2
dtype: int64

In [ ]:
stape()

In [37]:
# student_df.fillna(0)
# This will replace all missing values (NaN) in the student_df DataFrame with 0.

Filling missing values with mean of the column

In [ ]:
student_df['Attendance_fillNA']=student_df['Attendance'].fillna(student_df['Attendance'].mean())
# This will create a new column 'Attendance_fillNA' in the student_df DataFrame, where all missing values in the 'Attendance' column are replaced with the mean value of the 'Attendance' column.
student_df

,StudentID,Name,Age,Gender,MathScore,ScienceScore,Attendance,City,Attendance_fillNA
0,101,Amit,20.0,M,78.0,85.0,92.0,Delhi,92.000000
1,102,Riya,21.0,F,82.0,NaN,88.0,Mumbai,88.000000
2,103,Rahul,21.0,M,65.0,70.0,75.0,Bangalore,75.000000
3,104,Priya,20.0,F,90.0,92.0,NaN,Chennai,86.555556
4,105,Ankit,22.0,M,NaN,60.0,80.0,NaN,80.000000
5,106,Neha,21.0,F,88.0,91.0,95.0,Pune,95.000000
6,107,Sachin,23.0,M,72.0,NaN,85.0,Delhi,85.000000
7,108,Kavya,20.0,F,85.0,89.0,NaN,Mumbai,86.555556
8,109,Rohit,19.0,M,68.0,72.0,78.0,Jaipur,78.000000
9,110,Simran,22.0,F,91.0,94.0,96.0,NaN,96.000000
10,111,Arjun,21.0,M,NaN,65.0,NaN,Indore,86.555556
11,112,Meena,20.0,F,80.0,83.0,90.0,Bhopal,90.000000

In [ ]:
student_df.dtypes

StudentID              int64
Name                  object
Age                  float64
Gender                object
MathScore            float64
ScienceScore         float64
Attendance           float64
City                  object
Attendance_fillNA    float64
dtype: object

Renaming Columns

In [ ]:
student_df = student_df.rename(columns ={'Name':'Student Name'})
#We can rename the column using this rename method and we have to permanatly store in student_df
# Now 'Name' column is renamed to 'Student Name' Permanatly
student_df.head()

,StudentID,Student Name,Age,Gender,MathScore,ScienceScore,Attendance,City,Attendance_fillNA
0,101,Amit,20.0,M,78.0,85.0,92.0,Delhi,92.000000
1,102,Riya,21.0,F,82.0,NaN,88.0,Mumbai,88.000000
2,103,Rahul,21.0,M,65.0,70.0,75.0,Bangalore,75.000000
3,104,Priya,20.0,F,90.0,92.0,NaN,Chennai,86.555556
4,105,Ankit,22.0,M,NaN,60.0,80.0,NaN,80.000000

Change the Data types

In [ ]:
student_df['Age(int)'] = student_df['Age'].astype(int)
student_df.head()
# Here we have converted the 'Age' column from its current data type to integer using the astype(int) method.
# If there were any non-integer values in the 'Age' column, this operation would raise an error.

,StudentID,Student Name,Age,Gender,MathScore,ScienceScore,Attendance,City,Attendance_fillNA,Age(int)
0,101,Amit,20.0,M,78.0,85.0,92.0,Delhi,92.000000,20
1,102,Riya,21.0,F,82.0,NaN,88.0,Mumbai,88.000000,21
2,103,Rahul,21.0,M,65.0,70.0,75.0,Bangalore,75.000000,21
3,104,Priya,20.0,F,90.0,92.0,NaN,Chennai,86.555556,20
4,105,Ankit,22.0,M,NaN,60.0,80.0,NaN,80.000000,22

In [ ]:
# We we have a Nan value in MathScore column then while converting to int it will raise an error.
# Here we will use the fillna() method to handle missing values before converting the column to integer.
student_df['MathScore_fillNA(int)'] = student_df['MathScore'].fillna(student_df['MathScore'].mean()).astype(int)
student_df.head()

,StudentID,Student Name,Age,Gender,MathScore,ScienceScore,Attendance,City,Attendance_fillNA,Age(int),MathScore_fillNA(int)
0,101,Amit,20.0,M,78.0,85.0,92.0,Delhi,92.000000,20,78
1,102,Riya,21.0,F,82.0,NaN,88.0,Mumbai,88.000000,21,82
2,103,Rahul,21.0,M,65.0,70.0,75.0,Bangalore,75.000000,21,65
3,104,Priya,20.0,F,90.0,92.0,NaN,Chennai,86.555556,20,90
4,105,Ankit,22.0,M,NaN,60.0,80.0,NaN,80.000000,22,79

Applying function to a column

In [ ]:
student_df['New_ScienceScore'] = student_df['ScienceScore'].apply(lambda x: x + 5)
student_df.head()
# Here we have used the apply() method along with a lambda function to add 5 to each value in the 'ScienceScore' column.

,StudentID,Student Name,Age,Gender,MathScore,ScienceScore,Attendance,City,Attendance_fillNA,Age(int),MathScore_fillNA(int),New_ScienceScore
0,101,Amit,20.0,M,78.0,85.0,92.0,Delhi,92.000000,20,78,90.0
1,102,Riya,21.0,F,82.0,NaN,88.0,Mumbai,88.000000,21,82,NaN
2,103,Rahul,21.0,M,65.0,70.0,75.0,Bangalore,75.000000,21,65,75.0
3,104,Priya,20.0,F,90.0,92.0,NaN,Chennai,86.555556,20,90,97.0
4,105,Ankit,22.0,M,NaN,60.0,80.0,NaN,80.000000,22,79,65.0

Data Aggregating and Grouping

In [ ]:
grouped_by_city = student_df.groupby('City')['MathScore'].mean()
print(grouped_by_city)
# Here we have grouped the DataFrame by the 'City' column and calculated the mean of the 'MathScore' for each city using the groupby() method.

City
Bangalore    65.0
Bhopal       80.0
Chennai      90.0
Delhi        75.0
Indore        NaN
Jaipur       68.0
Mumbai       83.5
Pune         88.0
Name: MathScore, dtype: float64

In [ ]:
grouped_sum_by_city = student_df.groupby('City')['ScienceScore'].sum()
print(grouped_sum_by_city)
# Here we have grouped the DataFrame by the 'City' column and calculated the sum of the 'ScienceScore' for each city using the groupby() method.

City
Bangalore    70.0
Bhopal       83.0
Chennai      92.0
Delhi        85.0
Indore       65.0
Jaipur       72.0
Mumbai       89.0
Pune         91.0
Name: ScienceScore, dtype: float64

In [ ]:
# aggregate multiple functions
grouped_agg= student_df.groupby('City')['Age'].agg(['mean','sum','max'])
print(grouped_agg)
# Here we have grouped the DataFrame by the 'City' column and applied multiple aggregation functions (mean, sum, max) on the 'Age' column using the agg() method.

           mean   sum   max
City
Bangalore  21.0  21.0  21.0
Bhopal     20.0  20.0  20.0
Chennai    20.0  20.0  20.0
Delhi      21.5  43.0  23.0
Indore     21.0  21.0  21.0
Jaipur     19.0  19.0  19.0
Mumbai     20.5  41.0  21.0
Pune       21.0  21.0  21.0

Merging and Joining DataFrames

In [ ]:
# Sample DataFrame
data1= pd.DataFrame({'Key': ['A', 'B', 'C', 'D'],'Value1': [10, 20, 30, 40]})
data2= pd.DataFrame({'Key': ['A', 'B', 'C', 'E'],'Value2': [100, 200, 300, 400]})

In [ ]:
data1

  Key  Value1
0   A      10
1   B      20
2   C      30
3   D      40

In [ ]:
data2

  Key  Value2
0   A     100
1   B     200
2   C     300
3   E     400

In [ ]:
# Merge DataFrames on 'Key' column
pd.merge(data1, data2, on='Key', how='inner')
# We gave parameter data1 and data2 on which the merge will be performed and 'Key' is the common column on which we are merging and how='inner' means only the common keys will be considered in the merged DataFrame.
# on='Key' means on key column the merge will be performed.
# how='inner' means only the common keys will be considered in the merged DataFrame.

  Key  Value1  Value2
0   A      10     100
1   B      20     200
2   C      30     300

In [ ]:
pd.merge(data1, data2, on='Key', how='outer')
# We gave parameter data1 and data2 on which the merge will be performed and 'Key' is the common column on which we are merging and how='outer' means all keys from both DataFrames will be included in the merged DataFrame.
# on='Key' means on key column the merge will be performed.
# how='outer' means all keys from both DataFrames will be included in the merged DataFrame.

  Key  Value1  Value2
0   A    10.0   100.0
1   B    20.0   200.0
2   C    30.0   300.0
3   D    40.0     NaN
4   E     NaN   400.0

In [ ]:
pd.merge(data1, data2, on='Key', how='left')
#how='left' means all keys from the left DataFrame (data1) will be included in the merged DataFrame, and only matching keys from the right DataFrame (data2) will be merged.

  Key  Value1  Value2
0   A      10   100.0
1   B      20   200.0
2   C      30   300.0
3   D      40     NaN

In [ ]:
pd.merge(data1, data2, on='Key', how='right')
#how='right' means all keys from the right DataFrame (data2) will be included in the merged DataFrame, and only matching keys from the left DataFrame (data1) will be merged.

  Key  Value1  Value2
0   A    10.0     100
1   B    20.0     200
2   C    30.0     300
3   E     NaN     400

### (3) Reading Data from Different Sources

In [ ]:
import pandas as pd 
from io import StringIO
Data = '[{"Name": "Manish", "Age": "18", "City": "Indore", "Country": "India"}]'
# Converting JSON to DataFrame
data_df = pd.read_json(StringIO(Data))

In [ ]:
data_df
#Now data_df is a DataFrame created from the JSON data.

     Name  Age    City Country
0  Manish   18  Indore   India

In [ ]:
# Coverting DataFrame back to JSON
data_df.to_json()
# We have got the JSON representation of the DataFrame data_df.

'{"Name":{"0":"Manish"},"Age":{"0":18},"City":{"0":"Indore"},"Country":{"0":"India"}}'

In [ ]:
data_df.to_json(orient='index')
# We have got the JSON representation of the DataFrame data_df in 'index' orientation.
# This means that the JSON object will be structured with the DataFrame's index as the outermost keys, and each key will map to another JSON object representing the corresponding row of data.

'{"0":{"Name":"Manish","Age":18,"City":"Indore","Country":"India"}}'

In [ ]:
# Reading CSV data from a URL
url_df = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data", header=None)
url_df
# We can read CSV data directly from a URL using pandas' read_csv function.
# header=None is used to indicate that the CSV file does not have a header row, so pandas will assign default integer column names (0, 1, 2, etc.) to the DataFrame.

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
173,3,13.71,5.65,2.45,20.5,95,1.68,0.61,0.52,1.06,7.70,0.64,1.74,740
174,3,13.40,3.91,2.48,23.0,102,1.80,0.75,0.43,1.41,7.30,0.70,1.56,750
175,3,13.27,4.28,2.26,20.0,120,1.59,0.69,0.43,1.35,10.20,0.59,1.56,835
176,3,13.17,2.59,2.37,20.0,120,1.65,0.68,0.53,1.46,9.30,0.60,1.62,840
177,3,14.13,4.10,2.74,24.5,96,2.05,0.76,0.56,1.35,9.20,0.61,1.60,560

In [ ]:
# Now we will save this DataFrame to a local CSV file
url_df.to_csv("wine.csv")
# This will save the DataFrame url_df to a CSV file named "wine.csv" in the current working directory.

In [ ]:
# !pip install lxml
# !pip install html5lib
# !pip install beautifulsoup4

In [ ]:
# Reading data from HTML files
html_df = pd.read_html("https://www.fdic.gov/bank/individual/failed/banklist.html")    
html_df

[                                            Bank Name                City  \
 0                        The Santa Anna National Bank          Santa Anna
 1                                Pulaski Savings Bank             Chicago
 2                  The First National Bank of Lindsay             Lindsay
 3               Republic First Bank dba Republic Bank        Philadelphia
 4                                       Citizens Bank            Sac City
 5                            Heartland Tri-State Bank             Elkhart
 6                                 First Republic Bank       San Francisco
 7                                      Signature Bank            New York
 8                                 Silicon Valley Bank         Santa Clara
 9                                   Almena State Bank              Almena
 10                         First City Bank of Florida   Fort Walton Beach
 11                               The First State Bank       Barboursville
 12                                 Ericson State Bank             Ericson
 13                   City National Bank of New Jersey              Newark
 14                                      Resolute Bank              Maumee
 15                              Louisa Community Bank              Louisa
 16                               The Enloe State Bank              Cooper
 17                Washington Federal Bank for Savings             Chicago
 18    The Farmers and Merchants State Bank of Argonia             Argonia
 19                                Fayette County Bank          Saint Elmo
 20  Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
 21                                     First NBC Bank         New Orleans
 22                                      Proficio Bank  Cottonwood Heights
 23                      Seaway Bank and Trust Company             Chicago
 24                             Harvest Community Bank          Pennsville

             State   Cert                Acquiring Institution  \
 0           Texas   5520            Coleman County State Bank
 1        Illinois  28611                      Millennium Bank
 2        Oklahoma   4134               First Bank & Trust Co.
 3    Pennsylvania  27332    Fulton Bank, National Association
 4            Iowa   8758            Iowa Trust & Savings Bank
 5          Kansas  25851               Dream First Bank, N.A.
 6      California  59017            JPMorgan Chase Bank, N.A.
 7        New York  57053                  Flagstar Bank, N.A.
 8      California  24735  First Citizens Bank & Trust Company
 9          Kansas  15426                          Equity Bank
 10        Florida  16748            United Fidelity Bank, fsb
 11  West Virginia  14361                       MVB Bank, Inc.
 12       Nebraska  18265           Farmers and Merchants Bank
 13     New Jersey  21111                      Industrial Bank
 14           Ohio  58317                   Buckeye State Bank
 15       Kentucky  58112    Kentucky Farmers Bank Corporation
 16          Texas  10716                   Legend Bank, N. A.
 17       Illinois  30570                   Royal Savings Bank
 18         Kansas  17719                          Conway Bank
 19       Illinois   1802            United Fidelity Bank, fsb
 20      Wisconsin  30003  First-Citizens Bank & Trust Company
 21      Louisiana  58302                         Whitney Bank
 22           Utah  35495                    Cache Valley Bank
 23       Illinois  19328                  State Bank of Texas
 24     New Jersey  34951  First-Citizens Bank & Trust Company

          Closing Date  Fund  Sort ascending
 0       June 27, 2025                 10549
 1    January 17, 2025                 10548
 2    October 18, 2024                 10547
 3      April 26, 2024                 10546
 4    November 3, 2023                 10545
 5       July 28, 2023                 10544
 6         May 1, 2023                 10543
 7      March 12, 2023                 10540
 8      March 10, 2023                 10539
 9    October 23, 2020                 10538
 10   October 16, 2020                 10537
 11      April 3, 2020                 10536
 12  February 14, 2020                 10535
 13   November 1, 2019                 10534
 14   October 25, 2019                 10533
 15   October 25, 2019                 10532
 16       May 31, 2019                 10531
 17  December 15, 2017                 10530
 18   October 13, 2017                 10529
 19       May 26, 2017                 10528
 20        May 5, 2017                 10527
 21     April 28, 2017                 10526
 22      March 3, 2017                 10525
 23   January 27, 2017                 10524
 24   January 13, 2017                 10523  ]

In [ ]:
url = "https://en.wikipedia.org/wiki/Mobile_country_code"
pd.read_html(url)

HTTPError: HTTP Error 403: Forbidden

In [ ]:
pd.read_excel('Book1.xlsx', sheet_name='Sheet1')
# We can read Excel files using pandas' read_excel function.
# sheet_name='Sheet1' specifies that we want to read the data from the sheet named 'Sheet1' in the Excel file.
# By default, read_excel reads the first sheet if sheet_name is not specified.

NameError: name 'pd' is not defined

In [ ]:
df_excel = pd.read_excel('Book1.xlsx')

In [ ]:
#Pickle in Python is primarily used for serializing and deserializing Python object structures. In other words, it allows you to convert a Python object into a byte stream (serialization) to store it in a file/database, maintain program state across sessions, or transport data over a network, and then later reconstruct the original object from that byte stream (deserialization).
df_excel.to_pickle('excel_data.pkl')

In [ ]:
pd.read_pickle('excel_data.pkl')
#Used to read the pickled file and load the DataFrame back into memory.